In [1]:
import numpy as  np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = {'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [4]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [5]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [6]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [8]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [9]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [13]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [14]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [17]:
frame2['debt'] = 16.5

In [18]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5
six    2003  nevada  3.2  16.5

In [20]:
frame2['debt'] = np.arange(6.)

In [22]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0
six    2003  nevada  3.2   5.0

In [23]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [24]:
frame2['debt'] = val

In [25]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  nevada  3.2   NaN

In [26]:
frame2['eastern'] = frame2.state == 'ohio'

In [27]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6   NaN     True
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False
six    2003  nevada  3.2   NaN    False

In [28]:
del frame2['eastern']

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
pop = {'nevada' : {2001: 2.4, 2002: 2.9},
       'ohio' : {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [31]:
frame3 = pd.DataFrame(pop)

In [32]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [33]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [34]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [35]:
pdata = {'ohio': frame3['ohio'][:-1],
         'nevada':frame3['nevada'][:2]}

In [36]:
pd.DataFrame(pdata)

      ohio  nevada
2001   1.7     2.4
2002   3.6     2.9

In [37]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  nevada  ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [38]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [39]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7],
       [2003, 'nevada', 3.2, nan]], dtype=object)

In [40]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index

In [41]:
index

Index(['a', 'b', 'c'], dtype='object')

In [42]:
index[1:]

Index(['b', 'c'], dtype='object')

In [43]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [44]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [45]:
obj2.index is labels

True

In [46]:
frame3.columns

Index(['nevada', 'ohio'], dtype='object', name='state')

In [47]:
'ohio' in frame3.columns

True

In [48]:
2003 in frame.index

False

In [50]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])